analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
/* *****************************************************************************
 * Copyright (C) Analog Devices, All rights Reserved.
 * 
 * This software is protected by copyright laws of the United States and
 * of foreign countries. This material may also be protected by patent laws
 * and technology transfer regulations of the United States and of foreign
 * countries. This software is furnished under a license agreement and/or a
 * nondisclosure agreement and may only be used or reproduced in accordance
 * with the terms of those agreements. Dissemination of this information to
 * any party or parties not specified in the license agreement and/or
 * nondisclosure agreement is expressly prohibited.
 * 
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 * 
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 * 
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 **************************************************************************** */

/**
 * @file    dbb_rx_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the DBB_RX Peripheral Module.
 */

#ifndef MAX32665_INCLUDE_DBB_RX_REGS_H_
#define MAX32665_INCLUDE_DBB_RX_REGS_H_

/**************************************************************************************************
  Includes
**************************************************************************************************/

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************************************
  Macros
**************************************************************************************************/

#if defined (__ICCARM__)
#pragma system_include
#endif

#if defined (__CC_ARM)
#pragma anon_unions
#endif
/*/ @cond */
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     dbb_rx
 * @defgroup    dbb_rx_registers DBB_RX_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the DBB_RX Peripheral Module.
 * @details PAN2G RX Config
 */

/**
 * @ingroup dbb_rx_registers
 * Structure type to access the DBB_RX Registers.
 */
typedef struct {
    __IO uint32_t rx_info_version;                /**< <tt>\b 0x0000:</tt> DBB_RX RX_INFO_VERSION Register */
    __IO uint16_t rx_general_standard;            /**< <tt>\b 0x0004:</tt> DBB_RX RX_GENERAL_STANDARD Register */
    __IO uint16_t rx_general_control;             /**< <tt>\b 0x0006:</tt> DBB_RX RX_GENERAL_CONTROL Register */
    __IO uint16_t rx_phy_general_control;         /**< <tt>\b 0x0008:</tt> DBB_RX RX_PHY_GENERAL_CONTROL Register */
    __IO uint16_t rx_phy_general_agc_freeze_timer; /**< <tt>\b 0x000a:</tt> DBB_RX RX_PHY_GENERAL_AGC_FREEZE_TIMER Register */
    __IO uint16_t rx_phy_general_sig_detect_init_timer; /**< <tt>\b 0x000c:</tt> DBB_RX RX_PHY_GENERAL_SIG_DETECT_INIT_TIMER Register */
    __IO uint16_t rx_phy_general_sig_detect_rst_timer; /**< <tt>\b 0x000e:</tt> DBB_RX RX_PHY_GENERAL_SIG_DETECT_RST_TIMER Register */
    __IO uint32_t rx_phy_general_ddc_rst_timer;   /**< <tt>\b 0x0010:</tt> DBB_RX RX_PHY_GENERAL_DDC_RST_TIMER Register */
    __IO uint16_t rx_phy_ddc_alpha_start[8];      /**< <tt>\b 0x0014:</tt> DBB_RX RX_PHY_DDC_ALPHA_START Register */
    __IO uint16_t rx_phy_ddc_alpha_stop[8];       /**< <tt>\b 0x0024:</tt> DBB_RX RX_PHY_DDC_ALPHA_STOP Register */
    __IO uint16_t rx_phy_ddc_alpha_step[8];       /**< <tt>\b 0x0034:</tt> DBB_RX RX_PHY_DDC_ALPHA_STEP Register */
    __IO uint16_t rx_phy_ddc_beta[8];             /**< <tt>\b 0x0044:</tt> DBB_RX RX_PHY_DDC_BETA Register */
    __IO uint16_t rx_phy_ddc_rst_tmr;             /**< <tt>\b 0x0054:</tt> DBB_RX RX_PHY_DDC_RST_TMR Register */
    __IO uint16_t rx_phy_ddc_offs_i[8];           /**< <tt>\b 0x0056:</tt> DBB_RX RX_PHY_DDC_OFFS_I Register */
    __IO uint16_t rx_phy_ddc_offs_q[8];           /**< <tt>\b 0x0066:</tt> DBB_RX RX_PHY_DDC_OFFS_Q Register */
    __R  uint16_t rsv_0x76;
    __IO uint16_t rx_phy_agc5_overwr;             /**< <tt>\b 0x0078:</tt> DBB_RX RX_PHY_AGC5_OVERWR Register */
    __IO uint16_t rx_phy_agc5_gain;               /**< <tt>\b 0x007a:</tt> DBB_RX RX_PHY_AGC5_GAIN Register */
    __IO uint16_t rx_phy_agc5_thresh7upper;       /**< <tt>\b 0x007c:</tt> DBB_RX RX_PHY_AGC5_THRESH7UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh7lower;       /**< <tt>\b 0x007e:</tt> DBB_RX RX_PHY_AGC5_THRESH7LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh6upper;       /**< <tt>\b 0x0080:</tt> DBB_RX RX_PHY_AGC5_THRESH6UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh6lower;       /**< <tt>\b 0x0082:</tt> DBB_RX RX_PHY_AGC5_THRESH6LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh5upper;       /**< <tt>\b 0x0084:</tt> DBB_RX RX_PHY_AGC5_THRESH5UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh5lower;       /**< <tt>\b 0x0086:</tt> DBB_RX RX_PHY_AGC5_THRESH5LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh4upper;       /**< <tt>\b 0x0088:</tt> DBB_RX RX_PHY_AGC5_THRESH4UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh4lower;       /**< <tt>\b 0x008a:</tt> DBB_RX RX_PHY_AGC5_THRESH4LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh3upper;       /**< <tt>\b 0x008c:</tt> DBB_RX RX_PHY_AGC5_THRESH3UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh3lower;       /**< <tt>\b 0x008e:</tt> DBB_RX RX_PHY_AGC5_THRESH3LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh2upper;       /**< <tt>\b 0x0090:</tt> DBB_RX RX_PHY_AGC5_THRESH2UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh2lower;       /**< <tt>\b 0x0092:</tt> DBB_RX RX_PHY_AGC5_THRESH2LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh1upper;       /**< <tt>\b 0x0094:</tt> DBB_RX RX_PHY_AGC5_THRESH1UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh1lower;       /**< <tt>\b 0x0096:</tt> DBB_RX RX_PHY_AGC5_THRESH1LOWER Register */
    __IO uint16_t rx_phy_agc5_thresh0upper;       /**< <tt>\b 0x0098:</tt> DBB_RX RX_PHY_AGC5_THRESH0UPPER Register */
    __IO uint16_t rx_phy_agc5_thresh0lower;       /**< <tt>\b 0x009a:</tt> DBB_RX RX_PHY_AGC5_THRESH0LOWER Register */
    __IO uint16_t rx_phy_agc5_row_upper;          /**< <tt>\b 0x009c:</tt> DBB_RX RX_PHY_AGC5_ROW_UPPER Register */
    __IO uint16_t rx_phy_agc5_row_lower;          /**< <tt>\b 0x009e:</tt> DBB_RX RX_PHY_AGC5_ROW_LOWER Register */
    __IO uint16_t rx_phy_agc5_cntr;               /**< <tt>\b 0x00a0:</tt> DBB_RX RX_PHY_AGC5_CNTR Register */
    __IO uint16_t rx_phy_agc5_offs_init;          /**< <tt>\b 0x00a2:</tt> DBB_RX RX_PHY_AGC5_OFFS_INIT Register */
    __IO int16_t  rx_phy_phsmagest_filter_coeff[10]; /**< <tt>\b 0x00a4:</tt> DBB_RX RX_PHY_PHSMAGEST_FILTER_COEFF Register */
    __IO uint32_t rx_phy_phsmagest_scaling_factor; /**< <tt>\b 0x00b8:</tt> DBB_RX RX_PHY_PHSMAGEST_SCALING_FACTOR Register */
    __IO int16_t  rx_phy_filters_coefficients[16]; /**< <tt>\b 0x00bc:</tt> DBB_RX RX_PHY_FILTERS_COEFFICIENTS Register */
    __IO uint32_t rx_phy_filters_settings;        /**< <tt>\b 0x00dc:</tt> DBB_RX RX_PHY_FILTERS_SETTINGS Register */
    __IO uint16_t rx_phy_rssi_settings;           /**< <tt>\b 0x00e0:</tt> DBB_RX RX_PHY_RSSI_SETTINGS Register */
    __IO uint16_t rx_phy_rssi_ed_threshold;       /**< <tt>\b 0x00e2:</tt> DBB_RX RX_PHY_RSSI_ED_THRESHOLD Register */
    __IO uint16_t rx_phy_signal_det_settings;     /**< <tt>\b 0x00e4:</tt> DBB_RX RX_PHY_SIGNAL_DET_SETTINGS Register */
    __IO uint16_t rx_phy_signal_det_thresholds;   /**< <tt>\b 0x00e6:</tt> DBB_RX RX_PHY_SIGNAL_DET_THRESHOLDS Register */
    __IO uint16_t rx_phy_signal_det_select_v2;    /**< <tt>\b 0x00e8:</tt> DBB_RX RX_PHY_SIGNAL_DET_SELECT_V2 Register */
    __IO uint16_t rx_phy_signal_det_settings_v2_div_factor; /**< <tt>\b 0x00ea:</tt> DBB_RX RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR Register */
    __IO uint16_t rx_phy_signal_det_gear_v2;      /**< <tt>\b 0x00ec:</tt> DBB_RX RX_PHY_SIGNAL_DET_GEAR_V2 Register */
    __IO uint16_t rx_phy_signal_det_thresholds_v2_noise_factor; /**< <tt>\b 0x00ee:</tt> DBB_RX RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR Register */
    __IO uint32_t rx_phy_frame_sync_pd_comp;      /**< <tt>\b 0x00f0:</tt> DBB_RX RX_PHY_FRAME_SYNC_PD_COMP Register */
    __IO uint16_t rx_phy_frame_sync_sfd[4];       /**< <tt>\b 0x00f4:</tt> DBB_RX RX_PHY_FRAME_SYNC_SFD Register */
    __IO uint16_t rx_phy_frame_sync_settings;     /**< <tt>\b 0x00fc:</tt> DBB_RX RX_PHY_FRAME_SYNC_SETTINGS Register */
    __IO uint16_t rx_phy_frame_sync_settings_min_corr_val; /**< <tt>\b 0x00fe:</tt> DBB_RX RX_PHY_FRAME_SYNC_SETTINGS_MIN_CORR_VAL Register */
    __IO uint32_t rx_phy_frame_sync_timeout_tmr_periode; /**< <tt>\b 0x0100:</tt> DBB_RX RX_PHY_FRAME_SYNC_TIMEOUT_TMR_PERIODE Register */
    __IO uint16_t rx_phy_timing_sync_cfg;         /**< <tt>\b 0x0104:</tt> DBB_RX RX_PHY_TIMING_SYNC_CFG Register */
    __IO uint16_t rx_phy_timing_sync_log_sum;     /**< <tt>\b 0x0106:</tt> DBB_RX RX_PHY_TIMING_SYNC_LOG_SUM Register */
    __IO uint16_t rx_phy_tim_sync_old_cfg;        /**< <tt>\b 0x0108:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_CFG Register */
    __IO uint16_t rx_phy_tim_sync_old_te_thresh;  /**< <tt>\b 0x010a:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_TE_THRESH Register */
    __IO uint16_t rx_phy_tim_sync_old_te_thresh_scaling; /**< <tt>\b 0x010c:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_TE_THRESH_SCALING Register */
    __IO uint16_t rx_phy_tim_sync_old_init;       /**< <tt>\b 0x010e:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_INIT Register */
    __IO uint16_t rx_phy_tim_sync_old_te_cnt_thresh; /**< <tt>\b 0x0110:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH Register */
    __IO uint16_t rx_phy_tim_sync_old_te_cnt;     /**< <tt>\b 0x0112:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_TE_CNT Register */
    __IO uint16_t rx_phy_tim_sync_old_te_fifo_max_ptr; /**< <tt>\b 0x0114:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_TE_FIFO_MAX_PTR Register */
    __IO uint16_t rx_phy_tim_sync_old_adjust_cnt; /**< <tt>\b 0x0116:</tt> DBB_RX RX_PHY_TIM_SYNC_OLD_ADJUST_CNT Register */
    __IO uint32_t rx_phy_cfo_cfg;                 /**< <tt>\b 0x0118:</tt> DBB_RX RX_PHY_CFO_CFG Register */
    __IO uint16_t rx_phy_cfo_filter_coefficients[9]; /**< <tt>\b 0x011c:</tt> DBB_RX RX_PHY_CFO_FILTER_COEFFICIENTS Register */
    __IO uint16_t rx_phy_cfo_filter_scaling;      /**< <tt>\b 0x012e:</tt> DBB_RX RX_PHY_CFO_FILTER_SCALING Register */
    __IO uint16_t rx_phy_cfo_pa_precnt_num;       /**< <tt>\b 0x0130:</tt> DBB_RX RX_PHY_CFO_PA_PRECNT_NUM Register */
    __IO uint16_t rx_phy_cfo_ph_accum_part_num;   /**< <tt>\b 0x0132:</tt> DBB_RX RX_PHY_CFO_PH_ACCUM_PART_NUM Register */
    __IO uint16_t rx_phy_cfo_ed_thresh_factor;    /**< <tt>\b 0x0134:</tt> DBB_RX RX_PHY_CFO_ED_THRESH_FACTOR Register */
    __IO uint16_t rx_phy_cfo_ed_slow_factor;      /**< <tt>\b 0x0136:</tt> DBB_RX RX_PHY_CFO_ED_SLOW_FACTOR Register */
    __IO uint16_t rx_phy_cfo_ed_fast_factor;      /**< <tt>\b 0x0138:</tt> DBB_RX RX_PHY_CFO_ED_FAST_FACTOR Register */
    __R  uint16_t rsv_0x13a;
    __IO uint32_t rx_phy_cfo_pa_max_limit_val;    /**< <tt>\b 0x013c:</tt> DBB_RX RX_PHY_CFO_PA_MAX_LIMIT_VAL Register */
    __IO uint32_t rx_phy_cfo_cfo_est;             /**< <tt>\b 0x0140:</tt> DBB_RX RX_PHY_CFO_CFO_EST Register */
    __IO uint32_t rx_phy_cfo_cfo_est_khz;         /**< <tt>\b 0x0144:</tt> DBB_RX RX_PHY_CFO_CFO_EST_KHZ Register */
    __IO uint32_t rx_debug_dl_lb;                 /**< <tt>\b 0x0148:</tt> DBB_RX RX_DEBUG_DL_LB Register */
    __IO uint32_t rx_phy_dbg_cfg;                 /**< <tt>\b 0x014c:</tt> DBB_RX RX_PHY_DBG_CFG Register */
    __IO uint32_t rx_phy_dbg_data;                /**< <tt>\b 0x0150:</tt> DBB_RX RX_PHY_DBG_DATA Register */
    __IO uint16_t rx_dl_bypass;                   /**< <tt>\b 0x0154:</tt> DBB_RX RX_DL_BYPASS Register */
    __IO uint16_t rx_dl_crc_mode;                 /**< <tt>\b 0x0156:</tt> DBB_RX RX_DL_CRC_MODE Register */
    __IO uint32_t rx_dl_crc_init_phr;             /**< <tt>\b 0x0158:</tt> DBB_RX RX_DL_CRC_INIT_PHR Register */
    __IO uint32_t rx_dl_crc_init_pld;             /**< <tt>\b 0x015c:</tt> DBB_RX RX_DL_CRC_INIT_PLD Register */
    __IO uint32_t rx_dl_crc_residu;               /**< <tt>\b 0x0160:</tt> DBB_RX RX_DL_CRC_RESIDU Register */
    __IO uint16_t rx_dl_bch;                      /**< <tt>\b 0x0164:</tt> DBB_RX RX_DL_BCH Register */
    __IO uint16_t rx_dl_sprd_seq_err_nr;          /**< <tt>\b 0x0166:</tt> DBB_RX RX_DL_SPRD_SEQ_ERR_NR Register */
    __IO uint32_t rx_dl_ban_settings;             /**< <tt>\b 0x0168:</tt> DBB_RX RX_DL_BAN_SETTINGS Register */
    __IO uint32_t rx_dl_btle_settings_adv_acc_addr; /**< <tt>\b 0x016c:</tt> DBB_RX RX_DL_BTLE_SETTINGS_ADV_ACC_ADDR Register */
    __IO uint16_t rx_dl_btle_settings_whit;       /**< <tt>\b 0x0170:</tt> DBB_RX RX_DL_BTLE_SETTINGS_WHIT Register */
    __IO uint16_t rx_dl_phr_modulation;           /**< <tt>\b 0x0172:</tt> DBB_RX RX_DL_PHR_MODULATION Register */
    __IO uint32_t rx_phy_rssi_out_pwr;            /**< <tt>\b 0x0174:</tt> DBB_RX RX_PHY_RSSI_OUT_PWR Register */
    __IO uint16_t rx_dl_out_crc_stat;             /**< <tt>\b 0x0178:</tt> DBB_RX RX_DL_OUT_CRC_STAT Register */
    __IO uint16_t rx_dl_out_phr;                  /**< <tt>\b 0x017a:</tt> DBB_RX RX_DL_OUT_PHR Register */
    __IO uint16_t rx_dl_out_acc_add_nok;          /**< <tt>\b 0x017c:</tt> DBB_RX RX_DL_OUT_ACC_ADD_NOK Register */
    __IO uint16_t rx_dl_out_ci;                   /**< <tt>\b 0x017e:</tt> DBB_RX RX_DL_OUT_CI Register */
    __IO uint32_t rx_pld_mem[66];                 /**< <tt>\b 0x0180:</tt> DBB_RX RX_PLD_MEM Register */
    __IO uint32_t rx_phy_signal_det2_timeout_tmr_periode; /**< <tt>\b 0x0288:</tt> DBB_RX RX_PHY_SIGNAL_DET2_TIMEOUT_TMR_PERIODE Register */
    __IO uint16_t rx_phy_signal_det2_ed_slow_fact; /**< <tt>\b 0x028c:</tt> DBB_RX RX_PHY_SIGNAL_DET2_ED_SLOW_FACT Register */
    __IO uint16_t rx_phy_signal_det2_ed_fast_fact; /**< <tt>\b 0x028e:</tt> DBB_RX RX_PHY_SIGNAL_DET2_ED_FAST_FACT Register */
    __IO uint32_t rx_phy_signal_det2_ed_threshold_fact; /**< <tt>\b 0x0290:</tt> DBB_RX RX_PHY_SIGNAL_DET2_ED_THRESHOLD_FACT Register */
    __IO uint32_t rx_phy_signal_det2_ed_timeout_tmr_periode; /**< <tt>\b 0x0294:</tt> DBB_RX RX_PHY_SIGNAL_DET2_ED_TIMEOUT_TMR_PERIODE Register */
    __IO uint16_t rx_phy_signal_det2_stop_high_filt_corner; /**< <tt>\b 0x0298:</tt> DBB_RX RX_PHY_SIGNAL_DET2_STOP_HIGH_FILT_CORNER Register */
    __IO uint16_t rx_phy_signal_det2_beta_mux_en_stage; /**< <tt>\b 0x029a:</tt> DBB_RX RX_PHY_SIGNAL_DET2_BETA_MUX_EN_STAGE Register */
    __IO uint32_t rx_phy_signal_det2_beta_mux_threshold; /**< <tt>\b 0x029c:</tt> DBB_RX RX_PHY_SIGNAL_DET2_BETA_MUX_THRESHOLD Register */
    __IO uint32_t rx_phy_signal_det2_gamma_mux_en_stage; /**< <tt>\b 0x02a0:</tt> DBB_RX RX_PHY_SIGNAL_DET2_GAMMA_MUX_EN_STAGE Register */
    __IO uint32_t rx_phy_signal_det2_gamma_mux_threshold; /**< <tt>\b 0x02a4:</tt> DBB_RX RX_PHY_SIGNAL_DET2_GAMMA_MUX_THRESHOLD Register */
    __IO uint16_t rx_phy_signal_det2_alpha[4];    /**< <tt>\b 0x02a8:</tt> DBB_RX RX_PHY_SIGNAL_DET2_ALPHA Register */
    __IO uint16_t rx_phy_signal_det2_beta[4];     /**< <tt>\b 0x02b0:</tt> DBB_RX RX_PHY_SIGNAL_DET2_BETA Register */
    __IO uint16_t rx_phy_signal_det2_gamma[4];    /**< <tt>\b 0x02b8:</tt> DBB_RX RX_PHY_SIGNAL_DET2_GAMMA Register */
    __IO uint32_t rx_phy_cfo2_ed_timeout_tmr_periode; /**< <tt>\b 0x02c0:</tt> DBB_RX RX_PHY_CFO2_ED_TIMEOUT_TMR_PERIODE Register */
    __IO uint16_t rx_phy_cfo2_cfg_ph_accum_upscl_fact; /**< <tt>\b 0x02c4:</tt> DBB_RX RX_PHY_CFO2_CFG_PH_ACCUM_UPSCL_FACT Register */
    __IO uint16_t rx_phy_cfo2_cfg_ph_accum_dwnscl_fact; /**< <tt>\b 0x02c6:</tt> DBB_RX RX_PHY_CFO2_CFG_PH_ACCUM_DWNSCL_FACT Register */
    __IO uint32_t rx_phy_cfo2_cfg_ph_accum_comp;  /**< <tt>\b 0x02c8:</tt> DBB_RX RX_PHY_CFO2_CFG_PH_ACCUM_COMP Register */
    __IO uint16_t rx_phy_btlespeed_anti_alias_enable; /**< <tt>\b 0x02cc:</tt> DBB_RX RX_PHY_BTLESPEED_ANTI_ALIAS_ENABLE Register */
    __IO uint16_t rx_phy_btlespeed_filter_coeff[4]; /**< <tt>\b 0x02ce:</tt> DBB_RX RX_PHY_BTLESPEED_FILTER_COEFF Register */
    __IO uint16_t rx_phy_btlespeed_scaling_factor; /**< <tt>\b 0x02d6:</tt> DBB_RX RX_PHY_BTLESPEED_SCALING_FACTOR Register */
    __IO uint16_t rx_phy_frame_sync_lr_corr_length; /**< <tt>\b 0x02d8:</tt> DBB_RX RX_PHY_FRAME_SYNC_LR_CORR_LENGTH Register */
    __IO uint16_t rx_phy_frame_sync_lr_thresh_factor; /**< <tt>\b 0x02da:</tt> DBB_RX RX_PHY_FRAME_SYNC_LR_THRESH_FACTOR Register */
} mxc_dbb_rx_regs_t;

