analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
/* Register offsets for module DBB_RX */
/**
 * @ingroup    dbb_rx_registers
 * @defgroup   DBB_RX_Register_Offsets Register Offsets
 * @brief      DBB_RX Peripheral Register Offsets from the DBB_RX Base Peripheral Address.
 * @{
 */
#define MXC_R_DBB_RX_RX_INFO_VERSION                 ((uint32_t)0x00000000UL) /**< Offset from DBB_RX Base Address: <tt> 0x0000</tt> */
#define MXC_R_DBB_RX_RX_GENERAL_STANDARD             ((uint32_t)0x00000004UL) /**< Offset from DBB_RX Base Address: <tt> 0x0004</tt> */
#define MXC_R_DBB_RX_RX_GENERAL_CONTROL              ((uint32_t)0x00000006UL) /**< Offset from DBB_RX Base Address: <tt> 0x0006</tt> */
#define MXC_R_DBB_RX_RX_PHY_GENERAL_CONTROL          ((uint32_t)0x00000008UL) /**< Offset from DBB_RX Base Address: <tt> 0x0008</tt> */
#define MXC_R_DBB_RX_RX_PHY_GENERAL_AGC_FREEZE_TIMER ((uint32_t)0x0000000AUL) /**< Offset from DBB_RX Base Address: <tt> 0x000A</tt> */
#define MXC_R_DBB_RX_RX_PHY_GENERAL_SIG_DETECT_INIT_TIMER ((uint32_t)0x0000000CUL) /**< Offset from DBB_RX Base Address: <tt> 0x000C</tt> */
#define MXC_R_DBB_RX_RX_PHY_GENERAL_SIG_DETECT_RST_TIMER ((uint32_t)0x0000000EUL) /**< Offset from DBB_RX Base Address: <tt> 0x000E</tt> */
#define MXC_R_DBB_RX_RX_PHY_GENERAL_DDC_RST_TIMER    ((uint32_t)0x00000010UL) /**< Offset from DBB_RX Base Address: <tt> 0x0010</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_ALPHA_START          ((uint32_t)0x00000014UL) /**< Offset from DBB_RX Base Address: <tt> 0x0014</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_ALPHA_STOP           ((uint32_t)0x00000024UL) /**< Offset from DBB_RX Base Address: <tt> 0x0024</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_ALPHA_STEP           ((uint32_t)0x00000034UL) /**< Offset from DBB_RX Base Address: <tt> 0x0034</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_BETA                 ((uint32_t)0x00000044UL) /**< Offset from DBB_RX Base Address: <tt> 0x0044</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_RST_TMR              ((uint32_t)0x00000054UL) /**< Offset from DBB_RX Base Address: <tt> 0x0054</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_OFFS_I               ((uint32_t)0x00000056UL) /**< Offset from DBB_RX Base Address: <tt> 0x0056</tt> */
#define MXC_R_DBB_RX_RX_PHY_DDC_OFFS_Q               ((uint32_t)0x00000066UL) /**< Offset from DBB_RX Base Address: <tt> 0x0066</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_OVERWR              ((uint32_t)0x00000078UL) /**< Offset from DBB_RX Base Address: <tt> 0x0078</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_GAIN                ((uint32_t)0x0000007AUL) /**< Offset from DBB_RX Base Address: <tt> 0x007A</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH7UPPER        ((uint32_t)0x0000007CUL) /**< Offset from DBB_RX Base Address: <tt> 0x007C</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH7LOWER        ((uint32_t)0x0000007EUL) /**< Offset from DBB_RX Base Address: <tt> 0x007E</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH6UPPER        ((uint32_t)0x00000080UL) /**< Offset from DBB_RX Base Address: <tt> 0x0080</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH6LOWER        ((uint32_t)0x00000082UL) /**< Offset from DBB_RX Base Address: <tt> 0x0082</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH5UPPER        ((uint32_t)0x00000084UL) /**< Offset from DBB_RX Base Address: <tt> 0x0084</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH5LOWER        ((uint32_t)0x00000086UL) /**< Offset from DBB_RX Base Address: <tt> 0x0086</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH4UPPER        ((uint32_t)0x00000088UL) /**< Offset from DBB_RX Base Address: <tt> 0x0088</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH4LOWER        ((uint32_t)0x0000008AUL) /**< Offset from DBB_RX Base Address: <tt> 0x008A</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH3UPPER        ((uint32_t)0x0000008CUL) /**< Offset from DBB_RX Base Address: <tt> 0x008C</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH3LOWER        ((uint32_t)0x0000008EUL) /**< Offset from DBB_RX Base Address: <tt> 0x008E</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH2UPPER        ((uint32_t)0x00000090UL) /**< Offset from DBB_RX Base Address: <tt> 0x0090</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH2LOWER        ((uint32_t)0x00000092UL) /**< Offset from DBB_RX Base Address: <tt> 0x0092</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH1UPPER        ((uint32_t)0x00000094UL) /**< Offset from DBB_RX Base Address: <tt> 0x0094</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH1LOWER        ((uint32_t)0x00000096UL) /**< Offset from DBB_RX Base Address: <tt> 0x0096</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH0UPPER        ((uint32_t)0x00000098UL) /**< Offset from DBB_RX Base Address: <tt> 0x0098</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_THRESH0LOWER        ((uint32_t)0x0000009AUL) /**< Offset from DBB_RX Base Address: <tt> 0x009A</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_ROW_UPPER           ((uint32_t)0x0000009CUL) /**< Offset from DBB_RX Base Address: <tt> 0x009C</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_ROW_LOWER           ((uint32_t)0x0000009EUL) /**< Offset from DBB_RX Base Address: <tt> 0x009E</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_CNTR                ((uint32_t)0x000000A0UL) /**< Offset from DBB_RX Base Address: <tt> 0x00A0</tt> */
#define MXC_R_DBB_RX_RX_PHY_AGC5_OFFS_INIT           ((uint32_t)0x000000A2UL) /**< Offset from DBB_RX Base Address: <tt> 0x00A2</tt> */
#define MXC_R_DBB_RX_RX_PHY_PHSMAGEST_FILTER_COEFF   ((uint32_t)0x000000A4UL) /**< Offset from DBB_RX Base Address: <tt> 0x00A4</tt> */
#define MXC_R_DBB_RX_RX_PHY_PHSMAGEST_SCALING_FACTOR ((uint32_t)0x000000B8UL) /**< Offset from DBB_RX Base Address: <tt> 0x00B8</tt> */
#define MXC_R_DBB_RX_RX_PHY_FILTERS_COEFFICIENTS     ((uint32_t)0x000000BCUL) /**< Offset from DBB_RX Base Address: <tt> 0x00BC</tt> */
#define MXC_R_DBB_RX_RX_PHY_FILTERS_SETTINGS         ((uint32_t)0x000000DCUL) /**< Offset from DBB_RX Base Address: <tt> 0x00DC</tt> */
#define MXC_R_DBB_RX_RX_PHY_RSSI_SETTINGS            ((uint32_t)0x000000E0UL) /**< Offset from DBB_RX Base Address: <tt> 0x00E0</tt> */
#define MXC_R_DBB_RX_RX_PHY_RSSI_ED_THRESHOLD        ((uint32_t)0x000000E2UL) /**< Offset from DBB_RX Base Address: <tt> 0x00E2</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS      ((uint32_t)0x000000E4UL) /**< Offset from DBB_RX Base Address: <tt> 0x00E4</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS    ((uint32_t)0x000000E6UL) /**< Offset from DBB_RX Base Address: <tt> 0x00E6</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_SELECT_V2     ((uint32_t)0x000000E8UL) /**< Offset from DBB_RX Base Address: <tt> 0x00E8</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR ((uint32_t)0x000000EAUL) /**< Offset from DBB_RX Base Address: <tt> 0x00EA</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2       ((uint32_t)0x000000ECUL) /**< Offset from DBB_RX Base Address: <tt> 0x00EC</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR ((uint32_t)0x000000EEUL) /**< Offset from DBB_RX Base Address: <tt> 0x00EE</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP       ((uint32_t)0x000000F0UL) /**< Offset from DBB_RX Base Address: <tt> 0x00F0</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_SFD           ((uint32_t)0x000000F4UL) /**< Offset from DBB_RX Base Address: <tt> 0x00F4</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS      ((uint32_t)0x000000FCUL) /**< Offset from DBB_RX Base Address: <tt> 0x00FC</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_MIN_CORR_VAL ((uint32_t)0x000000FEUL) /**< Offset from DBB_RX Base Address: <tt> 0x00FE</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_TIMEOUT_TMR_PERIODE ((uint32_t)0x00000100UL) /**< Offset from DBB_RX Base Address: <tt> 0x0100</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIMING_SYNC_CFG          ((uint32_t)0x00000104UL) /**< Offset from DBB_RX Base Address: <tt> 0x0104</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIMING_SYNC_LOG_SUM      ((uint32_t)0x00000106UL) /**< Offset from DBB_RX Base Address: <tt> 0x0106</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG         ((uint32_t)0x00000108UL) /**< Offset from DBB_RX Base Address: <tt> 0x0108</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_THRESH   ((uint32_t)0x0000010AUL) /**< Offset from DBB_RX Base Address: <tt> 0x010A</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_THRESH_SCALING ((uint32_t)0x0000010CUL) /**< Offset from DBB_RX Base Address: <tt> 0x010C</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT        ((uint32_t)0x0000010EUL) /**< Offset from DBB_RX Base Address: <tt> 0x010E</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH ((uint32_t)0x00000110UL) /**< Offset from DBB_RX Base Address: <tt> 0x0110</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT      ((uint32_t)0x00000112UL) /**< Offset from DBB_RX Base Address: <tt> 0x0112</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_FIFO_MAX_PTR ((uint32_t)0x00000114UL) /**< Offset from DBB_RX Base Address: <tt> 0x0114</tt> */
#define MXC_R_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT  ((uint32_t)0x00000116UL) /**< Offset from DBB_RX Base Address: <tt> 0x0116</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_CFG                  ((uint32_t)0x00000118UL) /**< Offset from DBB_RX Base Address: <tt> 0x0118</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_FILTER_COEFFICIENTS  ((uint32_t)0x0000011CUL) /**< Offset from DBB_RX Base Address: <tt> 0x011C</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_FILTER_SCALING       ((uint32_t)0x0000012EUL) /**< Offset from DBB_RX Base Address: <tt> 0x012E</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_PA_PRECNT_NUM        ((uint32_t)0x00000130UL) /**< Offset from DBB_RX Base Address: <tt> 0x0130</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_PH_ACCUM_PART_NUM    ((uint32_t)0x00000132UL) /**< Offset from DBB_RX Base Address: <tt> 0x0132</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_ED_THRESH_FACTOR     ((uint32_t)0x00000134UL) /**< Offset from DBB_RX Base Address: <tt> 0x0134</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_ED_SLOW_FACTOR       ((uint32_t)0x00000136UL) /**< Offset from DBB_RX Base Address: <tt> 0x0136</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_ED_FAST_FACTOR       ((uint32_t)0x00000138UL) /**< Offset from DBB_RX Base Address: <tt> 0x0138</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_PA_MAX_LIMIT_VAL     ((uint32_t)0x0000013CUL) /**< Offset from DBB_RX Base Address: <tt> 0x013C</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_CFO_EST              ((uint32_t)0x00000140UL) /**< Offset from DBB_RX Base Address: <tt> 0x0140</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO_CFO_EST_KHZ          ((uint32_t)0x00000144UL) /**< Offset from DBB_RX Base Address: <tt> 0x0144</tt> */
#define MXC_R_DBB_RX_RX_DEBUG_DL_LB                  ((uint32_t)0x00000148UL) /**< Offset from DBB_RX Base Address: <tt> 0x0148</tt> */
#define MXC_R_DBB_RX_RX_PHY_DBG_CFG                  ((uint32_t)0x0000014CUL) /**< Offset from DBB_RX Base Address: <tt> 0x014C</tt> */
#define MXC_R_DBB_RX_RX_PHY_DBG_DATA                 ((uint32_t)0x00000150UL) /**< Offset from DBB_RX Base Address: <tt> 0x0150</tt> */
#define MXC_R_DBB_RX_RX_DL_BYPASS                    ((uint32_t)0x00000154UL) /**< Offset from DBB_RX Base Address: <tt> 0x0154</tt> */
#define MXC_R_DBB_RX_RX_DL_CRC_MODE                  ((uint32_t)0x00000156UL) /**< Offset from DBB_RX Base Address: <tt> 0x0156</tt> */
#define MXC_R_DBB_RX_RX_DL_CRC_INIT_PHR              ((uint32_t)0x00000158UL) /**< Offset from DBB_RX Base Address: <tt> 0x0158</tt> */
#define MXC_R_DBB_RX_RX_DL_CRC_INIT_PLD              ((uint32_t)0x0000015CUL) /**< Offset from DBB_RX Base Address: <tt> 0x015C</tt> */
#define MXC_R_DBB_RX_RX_DL_CRC_RESIDU                ((uint32_t)0x00000160UL) /**< Offset from DBB_RX Base Address: <tt> 0x0160</tt> */
#define MXC_R_DBB_RX_RX_DL_BCH                       ((uint32_t)0x00000164UL) /**< Offset from DBB_RX Base Address: <tt> 0x0164</tt> */
#define MXC_R_DBB_RX_RX_DL_SPRD_SEQ_ERR_NR           ((uint32_t)0x00000166UL) /**< Offset from DBB_RX Base Address: <tt> 0x0166</tt> */
#define MXC_R_DBB_RX_RX_DL_BAN_SETTINGS              ((uint32_t)0x00000168UL) /**< Offset from DBB_RX Base Address: <tt> 0x0168</tt> */
#define MXC_R_DBB_RX_RX_DL_BTLE_SETTINGS_ADV_ACC_ADDR ((uint32_t)0x0000016CUL) /**< Offset from DBB_RX Base Address: <tt> 0x016C</tt> */
#define MXC_R_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT        ((uint32_t)0x00000170UL) /**< Offset from DBB_RX Base Address: <tt> 0x0170</tt> */
#define MXC_R_DBB_RX_RX_DL_PHR_MODULATION            ((uint32_t)0x00000172UL) /**< Offset from DBB_RX Base Address: <tt> 0x0172</tt> */
#define MXC_R_DBB_RX_RX_PHY_RSSI_OUT_PWR             ((uint32_t)0x00000174UL) /**< Offset from DBB_RX Base Address: <tt> 0x0174</tt> */
#define MXC_R_DBB_RX_RX_DL_OUT_CRC_STAT              ((uint32_t)0x00000178UL) /**< Offset from DBB_RX Base Address: <tt> 0x0178</tt> */
#define MXC_R_DBB_RX_RX_DL_OUT_PHR                   ((uint32_t)0x0000017AUL) /**< Offset from DBB_RX Base Address: <tt> 0x017A</tt> */
#define MXC_R_DBB_RX_RX_DL_OUT_ACC_ADD_NOK           ((uint32_t)0x0000017CUL) /**< Offset from DBB_RX Base Address: <tt> 0x017C</tt> */
#define MXC_R_DBB_RX_RX_DL_OUT_CI                    ((uint32_t)0x0000017EUL) /**< Offset from DBB_RX Base Address: <tt> 0x017E</tt> */
#define MXC_R_DBB_RX_RX_PLD_MEM                      ((uint32_t)0x00000180UL) /**< Offset from DBB_RX Base Address: <tt> 0x0180</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_TIMEOUT_TMR_PERIODE ((uint32_t)0x00000288UL) /**< Offset from DBB_RX Base Address: <tt> 0x0288</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_ED_SLOW_FACT ((uint32_t)0x0000028CUL) /**< Offset from DBB_RX Base Address: <tt> 0x028C</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_ED_FAST_FACT ((uint32_t)0x0000028EUL) /**< Offset from DBB_RX Base Address: <tt> 0x028E</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_ED_THRESHOLD_FACT ((uint32_t)0x00000290UL) /**< Offset from DBB_RX Base Address: <tt> 0x0290</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_ED_TIMEOUT_TMR_PERIODE ((uint32_t)0x00000294UL) /**< Offset from DBB_RX Base Address: <tt> 0x0294</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_STOP_HIGH_FILT_CORNER ((uint32_t)0x00000298UL) /**< Offset from DBB_RX Base Address: <tt> 0x0298</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_BETA_MUX_EN_STAGE ((uint32_t)0x0000029AUL) /**< Offset from DBB_RX Base Address: <tt> 0x029A</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_BETA_MUX_THRESHOLD ((uint32_t)0x0000029CUL) /**< Offset from DBB_RX Base Address: <tt> 0x029C</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_GAMMA_MUX_EN_STAGE ((uint32_t)0x000002A0UL) /**< Offset from DBB_RX Base Address: <tt> 0x02A0</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_GAMMA_MUX_THRESHOLD ((uint32_t)0x000002A4UL) /**< Offset from DBB_RX Base Address: <tt> 0x02A4</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_ALPHA        ((uint32_t)0x000002A8UL) /**< Offset from DBB_RX Base Address: <tt> 0x02A8</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_BETA         ((uint32_t)0x000002B0UL) /**< Offset from DBB_RX Base Address: <tt> 0x02B0</tt> */
#define MXC_R_DBB_RX_RX_PHY_SIGNAL_DET2_GAMMA        ((uint32_t)0x000002B8UL) /**< Offset from DBB_RX Base Address: <tt> 0x02B8</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO2_ED_TIMEOUT_TMR_PERIODE ((uint32_t)0x000002C0UL) /**< Offset from DBB_RX Base Address: <tt> 0x02C0</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO2_CFG_PH_ACCUM_UPSCL_FACT ((uint32_t)0x000002C4UL) /**< Offset from DBB_RX Base Address: <tt> 0x02C4</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO2_CFG_PH_ACCUM_DWNSCL_FACT ((uint32_t)0x000002C6UL) /**< Offset from DBB_RX Base Address: <tt> 0x02C6</tt> */
#define MXC_R_DBB_RX_RX_PHY_CFO2_CFG_PH_ACCUM_COMP   ((uint32_t)0x000002C8UL) /**< Offset from DBB_RX Base Address: <tt> 0x02C8</tt> */
#define MXC_R_DBB_RX_RX_PHY_BTLESPEED_ANTI_ALIAS_ENABLE ((uint32_t)0x000002CCUL) /**< Offset from DBB_RX Base Address: <tt> 0x02CC</tt> */
#define MXC_R_DBB_RX_RX_PHY_BTLESPEED_FILTER_COEFF   ((uint32_t)0x000002CEUL) /**< Offset from DBB_RX Base Address: <tt> 0x02CE</tt> */
#define MXC_R_DBB_RX_RX_PHY_BTLESPEED_SCALING_FACTOR ((uint32_t)0x000002D6UL) /**< Offset from DBB_RX Base Address: <tt> 0x02D6</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_LR_CORR_LENGTH ((uint32_t)0x000002D8UL) /**< Offset from DBB_RX Base Address: <tt> 0x02D8</tt> */
#define MXC_R_DBB_RX_RX_PHY_FRAME_SYNC_LR_THRESH_FACTOR ((uint32_t)0x000002DAUL) /**< Offset from DBB_RX Base Address: <tt> 0x02DA</tt> */
/**@} end of group dbb_rx_registers */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_INFO_VERSION DBB_RX_RX_INFO_VERSION
 * @brief    version
 * @{
 */
#define MXC_F_DBB_RX_RX_INFO_VERSION_MINOR_POS         0 /**< RX_INFO_VERSION_MINOR Position */
#define MXC_F_DBB_RX_RX_INFO_VERSION_MINOR             ((uint32_t)(0xFFUL << MXC_F_DBB_RX_RX_INFO_VERSION_MINOR_POS)) /**< RX_INFO_VERSION_MINOR Mask */

#define MXC_F_DBB_RX_RX_INFO_VERSION_MAJOR_POS         8 /**< RX_INFO_VERSION_MAJOR Position */
#define MXC_F_DBB_RX_RX_INFO_VERSION_MAJOR             ((uint32_t)(0xFFUL << MXC_F_DBB_RX_RX_INFO_VERSION_MAJOR_POS)) /**< RX_INFO_VERSION_MAJOR Mask */

/**@} end of group DBB_RX_RX_INFO_VERSION_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_GENERAL_STANDARD DBB_RX_RX_GENERAL_STANDARD
 * @brief    Standard: 1 = Zigbee (15.4), 2 = BAN (15.6),  3 = Bluetooth Low Energy (BTLE)
 * @{
 */
#define MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD_POS  0 /**< RX_GENERAL_STANDARD_STANDARD Position */
#define MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD      ((uint16_t)(0x3UL << MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD_POS)) /**< RX_GENERAL_STANDARD_STANDARD Mask */
#define MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_ZIGBEE ((uint16_t)0x1UL) /**< RX_GENERAL_STANDARD_STANDARD_ZIGBEE Value */
#define MXC_S_DBB_RX_RX_GENERAL_STANDARD_STANDARD_ZIGBEE (MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_ZIGBEE << MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD_POS) /**< RX_GENERAL_STANDARD_STANDARD_ZIGBEE Setting */
#define MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BAN  ((uint16_t)0x2UL) /**< RX_GENERAL_STANDARD_STANDARD_BAN Value */
#define MXC_S_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BAN  (MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BAN << MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD_POS) /**< RX_GENERAL_STANDARD_STANDARD_BAN Setting */
#define MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BTLE ((uint16_t)0x3UL) /**< RX_GENERAL_STANDARD_STANDARD_BTLE Value */
#define MXC_S_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BTLE (MXC_V_DBB_RX_RX_GENERAL_STANDARD_STANDARD_BTLE << MXC_F_DBB_RX_RX_GENERAL_STANDARD_STANDARD_POS) /**< RX_GENERAL_STANDARD_STANDARD_BTLE Setting */

