analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
/**@} end of group DBB_RX_RX_GENERAL_STANDARD_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_GENERAL_CONTROL DBB_RX_RX_GENERAL_CONTROL
 * @brief    control
 * @{
 */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_AGC_ENABLE_POS 0 /**< RX_GENERAL_CONTROL_AGC_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_AGC_ENABLE     ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_AGC_ENABLE_POS)) /**< RX_GENERAL_CONTROL_AGC_ENABLE Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_RESERVED_POS   1 /**< RX_GENERAL_CONTROL_RESERVED Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_RESERVED       ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_RESERVED_POS)) /**< RX_GENERAL_CONTROL_RESERVED Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_PHY_ENABLE_POS 2 /**< RX_GENERAL_CONTROL_PHY_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_PHY_ENABLE     ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_PHY_ENABLE_POS)) /**< RX_GENERAL_CONTROL_PHY_ENABLE Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_DL_ENABLE_POS  3 /**< RX_GENERAL_CONTROL_DL_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_DL_ENABLE      ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_DL_ENABLE_POS)) /**< RX_GENERAL_CONTROL_DL_ENABLE Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_PH_MG_EST_ENABLE_POS 4 /**< RX_GENERAL_CONTROL_PH_MG_EST_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_PH_MG_EST_ENABLE ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_PH_MG_EST_ENABLE_POS)) /**< RX_GENERAL_CONTROL_PH_MG_EST_ENABLE Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_CFO_HPF_ENABLE_POS 5 /**< RX_GENERAL_CONTROL_CFO_HPF_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_CFO_HPF_ENABLE ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_CFO_HPF_ENABLE_POS)) /**< RX_GENERAL_CONTROL_CFO_HPF_ENABLE Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_BTLE_LNGRNG_EN_POS 6 /**< RX_GENERAL_CONTROL_BTLE_LNGRNG_EN Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_BTLE_LNGRNG_EN ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_BTLE_LNGRNG_EN_POS)) /**< RX_GENERAL_CONTROL_BTLE_LNGRNG_EN Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_DISABLE_TIMING_SYNC_POS 7 /**< RX_GENERAL_CONTROL_DISABLE_TIMING_SYNC Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_DISABLE_TIMING_SYNC ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_DISABLE_TIMING_SYNC_POS)) /**< RX_GENERAL_CONTROL_DISABLE_TIMING_SYNC Mask */

#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_ENCRYPTION_ENABLE_POS 8 /**< RX_GENERAL_CONTROL_ENCRYPTION_ENABLE Position */
#define MXC_F_DBB_RX_RX_GENERAL_CONTROL_ENCRYPTION_ENABLE ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_GENERAL_CONTROL_ENCRYPTION_ENABLE_POS)) /**< RX_GENERAL_CONTROL_ENCRYPTION_ENABLE Mask */

/**@} end of group DBB_RX_RX_GENERAL_CONTROL_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_GENERAL_CONTROL DBB_RX_RX_PHY_GENERAL_CONTROL
 * @brief    control
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_SYNC_AFTER_SIG_DETECT_POS 0 /**< RX_PHY_GENERAL_CONTROL_SYNC_AFTER_SIG_DETECT Position */
#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_SYNC_AFTER_SIG_DETECT ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_SYNC_AFTER_SIG_DETECT_POS)) /**< RX_PHY_GENERAL_CONTROL_SYNC_AFTER_SIG_DETECT Mask */

#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_START_CCA_POS 1 /**< RX_PHY_GENERAL_CONTROL_START_CCA Position */
#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_START_CCA  ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_START_CCA_POS)) /**< RX_PHY_GENERAL_CONTROL_START_CCA Mask */

#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_POS 2 /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC Position */
#define MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC  ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_POS)) /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC Mask */
#define MXC_V_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_UNTIL_PLD ((uint16_t)0x0UL) /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC_UNTIL_PLD Value */
#define MXC_S_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_UNTIL_PLD (MXC_V_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_UNTIL_PLD << MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_POS) /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC_UNTIL_PLD Setting */
#define MXC_V_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_DURING_PLD ((uint16_t)0x1UL) /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC_DURING_PLD Value */
#define MXC_S_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_DURING_PLD (MXC_V_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_DURING_PLD << MXC_F_DBB_RX_RX_PHY_GENERAL_CONTROL_CONT_SYNC_POS) /**< RX_PHY_GENERAL_CONTROL_CONT_SYNC_DURING_PLD Setting */

/**@} end of group DBB_RX_RX_PHY_GENERAL_CONTROL_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_OVERWR DBB_RX_RX_PHY_AGC5_OVERWR
 * @brief    overwr
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_WR_GAIN_POS    0 /**< RX_PHY_AGC5_OVERWR_WR_GAIN Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_WR_GAIN        ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_WR_GAIN_POS)) /**< RX_PHY_AGC5_OVERWR_WR_GAIN Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_NEW_GAIN_POS   1 /**< RX_PHY_AGC5_OVERWR_NEW_GAIN Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_NEW_GAIN       ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_AGC5_OVERWR_NEW_GAIN_POS)) /**< RX_PHY_AGC5_OVERWR_NEW_GAIN Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_OVERWR_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_GAIN DBB_RX_RX_PHY_AGC5_GAIN
 * @brief    gain
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INIT_POS         0 /**< RX_PHY_AGC5_GAIN_INIT Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INIT             ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INIT_POS)) /**< RX_PHY_AGC5_GAIN_INIT Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MIN_POS          3 /**< RX_PHY_AGC5_GAIN_MIN Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MIN              ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MIN_POS)) /**< RX_PHY_AGC5_GAIN_MIN Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MAX_POS          6 /**< RX_PHY_AGC5_GAIN_MAX Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MAX              ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_MAX_POS)) /**< RX_PHY_AGC5_GAIN_MAX Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INDEX_POS        9 /**< RX_PHY_AGC5_GAIN_INDEX Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INDEX            ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_AGC5_GAIN_INDEX_POS)) /**< RX_PHY_AGC5_GAIN_INDEX Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_GAIN_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_ROW_UPPER DBB_RX_RX_PHY_AGC5_ROW_UPPER
 * @brief    row_upper
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_LE_POS      0 /**< RX_PHY_AGC5_ROW_UPPER_LE Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_LE          ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_LE_POS)) /**< RX_PHY_AGC5_ROW_UPPER_LE Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_INCR_POS    1 /**< RX_PHY_AGC5_ROW_UPPER_INCR Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_INCR        ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_INCR_POS)) /**< RX_PHY_AGC5_ROW_UPPER_INCR Mask */

