analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_BLK_POS     5 /**< RX_PHY_AGC5_ROW_UPPER_BLK Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_BLK         ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_UPPER_BLK_POS)) /**< RX_PHY_AGC5_ROW_UPPER_BLK Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_ROW_UPPER_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_ROW_LOWER DBB_RX_RX_PHY_AGC5_ROW_LOWER
 * @brief    row_lower
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_LE_POS      0 /**< RX_PHY_AGC5_ROW_LOWER_LE Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_LE          ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_LE_POS)) /**< RX_PHY_AGC5_ROW_LOWER_LE Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_INCR_POS    1 /**< RX_PHY_AGC5_ROW_LOWER_INCR Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_INCR        ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_INCR_POS)) /**< RX_PHY_AGC5_ROW_LOWER_INCR Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_BLK_POS     5 /**< RX_PHY_AGC5_ROW_LOWER_BLK Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_BLK         ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_AGC5_ROW_LOWER_BLK_POS)) /**< RX_PHY_AGC5_ROW_LOWER_BLK Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_ROW_LOWER_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_CNTR DBB_RX_RX_PHY_AGC5_CNTR
 * @brief    cntr
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_STABLE_POS       0 /**< RX_PHY_AGC5_CNTR_STABLE Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_STABLE           ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_STABLE_POS)) /**< RX_PHY_AGC5_CNTR_STABLE Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_VALID_POS        8 /**< RX_PHY_AGC5_CNTR_VALID Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_VALID            ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_AGC5_CNTR_VALID_POS)) /**< RX_PHY_AGC5_CNTR_VALID Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_CNTR_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_AGC5_OFFS_INIT DBB_RX_RX_PHY_AGC5_OFFS_INIT
 * @brief    offs_init
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_START_POS   0 /**< RX_PHY_AGC5_OFFS_INIT_START Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_START       ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_START_POS)) /**< RX_PHY_AGC5_OFFS_INIT_START Mask */

#define MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_DONE_POS    1 /**< RX_PHY_AGC5_OFFS_INIT_DONE Position */
#define MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_DONE        ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_AGC5_OFFS_INIT_DONE_POS)) /**< RX_PHY_AGC5_OFFS_INIT_DONE Mask */

/**@} end of group DBB_RX_RX_PHY_AGC5_OFFS_INIT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_FILTERS_SETTINGS DBB_RX_RX_PHY_FILTERS_SETTINGS
 * @brief    settings
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SKIP_MUX_SEL_POS 0 /**< RX_PHY_FILTERS_SETTINGS_SKIP_MUX_SEL Position */
#define MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SKIP_MUX_SEL ((uint32_t)(0x3FUL << MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SKIP_MUX_SEL_POS)) /**< RX_PHY_FILTERS_SETTINGS_SKIP_MUX_SEL Mask */

#define MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SCALING_FACTOR_POS 6 /**< RX_PHY_FILTERS_SETTINGS_SCALING_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SCALING_FACTOR ((uint32_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_FILTERS_SETTINGS_SCALING_FACTOR_POS)) /**< RX_PHY_FILTERS_SETTINGS_SCALING_FACTOR Mask */

/**@} end of group DBB_RX_RX_PHY_FILTERS_SETTINGS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_RSSI_SETTINGS DBB_RX_RX_PHY_RSSI_SETTINGS
 * @brief    settings
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_NUM_CALC_POS 0 /**< RX_PHY_RSSI_SETTINGS_NUM_CALC Position */
#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_NUM_CALC     ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_NUM_CALC_POS)) /**< RX_PHY_RSSI_SETTINGS_NUM_CALC Mask */

#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_POW_TWO_SAMPLES_POS 4 /**< RX_PHY_RSSI_SETTINGS_POW_TWO_SAMPLES Position */
#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_POW_TWO_SAMPLES ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_POW_TWO_SAMPLES_POS)) /**< RX_PHY_RSSI_SETTINGS_POW_TWO_SAMPLES Mask */

#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_COMP_FACT_POS 8 /**< RX_PHY_RSSI_SETTINGS_COMP_FACT Position */
#define MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_COMP_FACT    ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_RSSI_SETTINGS_COMP_FACT_POS)) /**< RX_PHY_RSSI_SETTINGS_COMP_FACT Mask */

/**@} end of group DBB_RX_RX_PHY_RSSI_SETTINGS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS
 * @brief    settings
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DIV_FACTOR_POS 0 /**< RX_PHY_SIGNAL_DET_SETTINGS_DIV_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DIV_FACTOR ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DIV_FACTOR_POS)) /**< RX_PHY_SIGNAL_DET_SETTINGS_DIV_FACTOR Mask */

#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DELTA_SAMPLES_POS 4 /**< RX_PHY_SIGNAL_DET_SETTINGS_DELTA_SAMPLES Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DELTA_SAMPLES ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_DELTA_SAMPLES_POS)) /**< RX_PHY_SIGNAL_DET_SETTINGS_DELTA_SAMPLES Mask */

/**@} end of group DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS
 * @brief    thresholds
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_DELTA_AMP_POS 0 /**< RX_PHY_SIGNAL_DET_THRESHOLDS_DELTA_AMP Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_DELTA_AMP ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_DELTA_AMP_POS)) /**< RX_PHY_SIGNAL_DET_THRESHOLDS_DELTA_AMP Mask */

#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_NOISE_FACTOR_POS 8 /**< RX_PHY_SIGNAL_DET_THRESHOLDS_NOISE_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_NOISE_FACTOR ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_NOISE_FACTOR_POS)) /**< RX_PHY_SIGNAL_DET_THRESHOLDS_NOISE_FACTOR Mask */

