analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
/**@} end of group DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR
 * @brief    settings_v2
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_DIV_FACTOR_POS 0 /**< RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_DIV_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_DIV_FACTOR ((uint16_t)(0xFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_DIV_FACTOR_POS)) /**< RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_DIV_FACTOR Mask */

/**@} end of group DBB_RX_RX_PHY_SIGNAL_DET_SETTINGS_V2_DIV_FACTOR_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2 DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2
 * @brief    gear_v2
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_DELTA_POS 0 /**< RX_PHY_SIGNAL_DET_GEAR_V2_DELTA Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_DELTA   ((uint16_t)(0x3UL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_DELTA_POS)) /**< RX_PHY_SIGNAL_DET_GEAR_V2_DELTA Mask */

#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_START_POS 2 /**< RX_PHY_SIGNAL_DET_GEAR_V2_START Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_START   ((uint16_t)(0x3UL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_START_POS)) /**< RX_PHY_SIGNAL_DET_GEAR_V2_START Mask */

#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_MAX_POS 4 /**< RX_PHY_SIGNAL_DET_GEAR_V2_MAX Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_MAX     ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_MAX_POS)) /**< RX_PHY_SIGNAL_DET_GEAR_V2_MAX Mask */

#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_STEP_POS 7 /**< RX_PHY_SIGNAL_DET_GEAR_V2_STEP Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_STEP    ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_STEP_POS)) /**< RX_PHY_SIGNAL_DET_GEAR_V2_STEP Mask */

/**@} end of group DBB_RX_RX_PHY_SIGNAL_DET_GEAR_V2_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR
 * @brief    thresholds_v2
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_NOISE_FACTOR_POS 0 /**< RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_NOISE_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_NOISE_FACTOR ((uint16_t)(0x1FUL << MXC_F_DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_NOISE_FACTOR_POS)) /**< RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_NOISE_FACTOR Mask */

/**@} end of group DBB_RX_RX_PHY_SIGNAL_DET_THRESHOLDS_V2_NOISE_FACTOR_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP
 * @brief    pd_comp
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_POS 0 /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR Position */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_POS)) /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR Mask */
#define MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_ALL ((uint32_t)0x1UL) /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_ALL Value */
#define MXC_S_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_ALL (MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_ALL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_POS) /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_ALL Setting */
#define MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_FIRST ((uint32_t)0x0UL) /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_FIRST Value */
#define MXC_S_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_FIRST (MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_FIRST << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_POS) /**< RX_PHY_FRAME_SYNC_PD_COMP_COMP_ALL_GAIN_CORR_FIRST Setting */

#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_NUM_SAMPLES_CORR_POS 1 /**< RX_PHY_FRAME_SYNC_PD_COMP_NUM_SAMPLES_CORR Position */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_NUM_SAMPLES_CORR ((uint32_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_NUM_SAMPLES_CORR_POS)) /**< RX_PHY_FRAME_SYNC_PD_COMP_NUM_SAMPLES_CORR Mask */

/**@} end of group DBB_RX_RX_PHY_FRAME_SYNC_PD_COMP_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS
 * @brief    settings
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_CORR_LENGTH_POS 0 /**< RX_PHY_FRAME_SYNC_SETTINGS_CORR_LENGTH Position */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_CORR_LENGTH ((uint16_t)(0x7FUL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_CORR_LENGTH_POS)) /**< RX_PHY_FRAME_SYNC_SETTINGS_CORR_LENGTH Mask */

#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_THRESH_FACTOR_POS 7 /**< RX_PHY_FRAME_SYNC_SETTINGS_THRESH_FACTOR Position */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_THRESH_FACTOR ((uint16_t)(0x7FUL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_THRESH_FACTOR_POS)) /**< RX_PHY_FRAME_SYNC_SETTINGS_THRESH_FACTOR Mask */

#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_POS 14 /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT Position */
#define MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_POS)) /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT Mask */
#define MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_ALL ((uint16_t)0x1UL) /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_ALL Value */
#define MXC_S_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_ALL (MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_ALL << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_POS) /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_ALL Setting */
#define MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_SAMPLE ((uint16_t)0x0UL) /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_SAMPLE Value */
#define MXC_S_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_SAMPLE (MXC_V_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_SAMPLE << MXC_F_DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_POS) /**< RX_PHY_FRAME_SYNC_SETTINGS_HARD_DETECT_SAMPLE Setting */

/**@} end of group DBB_RX_RX_PHY_FRAME_SYNC_SETTINGS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIMING_SYNC_CFG DBB_RX_RX_PHY_TIMING_SYNC_CFG
 * @brief    cfg
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_LIMIT_POS  0 /**< RX_PHY_TIMING_SYNC_CFG_LIMIT Position */
#define MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_LIMIT      ((uint16_t)(0x1FFUL << MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_LIMIT_POS)) /**< RX_PHY_TIMING_SYNC_CFG_LIMIT Mask */

#define MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_BITSHIFT_POS 9 /**< RX_PHY_TIMING_SYNC_CFG_BITSHIFT Position */
#define MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_BITSHIFT   ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_TIMING_SYNC_CFG_BITSHIFT_POS)) /**< RX_PHY_TIMING_SYNC_CFG_BITSHIFT Mask */

/**@} end of group DBB_RX_RX_PHY_TIMING_SYNC_CFG_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG
 * @brief    Timing sync general config: 0 = Dynamic thresholding mode, 1 = Static
 *           thresholding mode
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_POS   0 /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG       ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_POS)) /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG Mask */
#define MXC_V_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_STATIC ((uint16_t)0x1UL) /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG_STATIC Value */
#define MXC_S_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_STATIC (MXC_V_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_STATIC << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_POS) /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG_STATIC Setting */
#define MXC_V_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_DYNAMIC ((uint16_t)0x0UL) /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG_DYNAMIC Value */
#define MXC_S_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_DYNAMIC (MXC_V_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_DYNAMIC << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_CFG_POS) /**< RX_PHY_TIM_SYNC_OLD_CFG_CFG_DYNAMIC Setting */

/**@} end of group DBB_RX_RX_PHY_TIM_SYNC_OLD_CFG_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT
 * @brief    init
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_SEL_CNT_MAX_POS 0 /**< RX_PHY_TIM_SYNC_OLD_INIT_SEL_CNT_MAX Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_SEL_CNT_MAX ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_SEL_CNT_MAX_POS)) /**< RX_PHY_TIM_SYNC_OLD_INIT_SEL_CNT_MAX Mask */

