analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_MIN_NUM_CHIP_POS 8 /**< RX_PHY_TIM_SYNC_OLD_INIT_MIN_NUM_CHIP Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_MIN_NUM_CHIP ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_MIN_NUM_CHIP_POS)) /**< RX_PHY_TIM_SYNC_OLD_INIT_MIN_NUM_CHIP Mask */

/**@} end of group DBB_RX_RX_PHY_TIM_SYNC_OLD_INIT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH
 * @brief    te_cnt_thresh
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_VALUE_POS 0 /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_VALUE Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_VALUE ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_VALUE_POS)) /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_VALUE Mask */

#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_INCR_VALUE_POS 8 /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_INCR_VALUE Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_INCR_VALUE ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_INCR_VALUE_POS)) /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_INCR_VALUE Mask */

/**@} end of group DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_THRESH_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT
 * @brief    te_cnt
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_INCR_VALUE_POS 0 /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_INCR_VALUE Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_INCR_VALUE ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_INCR_VALUE_POS)) /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_INCR_VALUE Mask */

#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_DECR_VALUE_POS 8 /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_DECR_VALUE Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_DECR_VALUE ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_DECR_VALUE_POS)) /**< RX_PHY_TIM_SYNC_OLD_TE_CNT_DECR_VALUE Mask */

/**@} end of group DBB_RX_RX_PHY_TIM_SYNC_OLD_TE_CNT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT
 * @brief    adjust_cnt
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_FAST_POS 0 /**< RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_FAST Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_FAST ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_FAST_POS)) /**< RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_FAST Mask */

#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_SLOW_POS 8 /**< RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_SLOW Position */
#define MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_SLOW ((uint16_t)(0xFFUL << MXC_F_DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_SLOW_POS)) /**< RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_IS_SLOW Mask */

/**@} end of group DBB_RX_RX_PHY_TIM_SYNC_OLD_ADJUST_CNT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_CFO_CFG DBB_RX_RX_PHY_CFO_CFG
 * @brief    CFO estimation and compensation config general (cfg(0)=enable, cfg(1)=comp.
 *           enable, cfg(2)=comp. data sign invert, cfg(3)=comp. data SW override enable,
 *           cfg(31) and cfg(24:16)=CFO comp. data used in override mode)
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_ENABLE_POS         0 /**< RX_PHY_CFO_CFG_ENABLE Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_ENABLE             ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_ENABLE_POS)) /**< RX_PHY_CFO_CFG_ENABLE Mask */

#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_ENABLE_POS    1 /**< RX_PHY_CFO_CFG_COMP_ENABLE Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_ENABLE        ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_ENABLE_POS)) /**< RX_PHY_CFO_CFG_COMP_ENABLE Mask */

#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_INV_POS       2 /**< RX_PHY_CFO_CFG_COMP_INV Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_INV           ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_INV_POS)) /**< RX_PHY_CFO_CFG_COMP_INV Mask */

#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_SW_OVER_POS        3 /**< RX_PHY_CFO_CFG_SW_OVER Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_SW_OVER            ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_SW_OVER_POS)) /**< RX_PHY_CFO_CFG_SW_OVER Mask */

#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA0_POS     16 /**< RX_PHY_CFO_CFG_COMP_DATA0 Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA0         ((uint32_t)(0x1FFUL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA0_POS)) /**< RX_PHY_CFO_CFG_COMP_DATA0 Mask */

#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA1_POS     31 /**< RX_PHY_CFO_CFG_COMP_DATA1 Position */
#define MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA1         ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_CFO_CFG_COMP_DATA1_POS)) /**< RX_PHY_CFO_CFG_COMP_DATA1 Mask */

/**@} end of group DBB_RX_RX_PHY_CFO_CFG_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DEBUG_DL_LB DBB_RX_RX_DEBUG_DL_LB
 * @brief    loop back datalink: 0 = normal mode, 1 = loopback mode
 * @{
 */
#define MXC_F_DBB_RX_RX_DEBUG_DL_LB_LOOP_POS           0 /**< RX_DEBUG_DL_LB_LOOP Position */
#define MXC_F_DBB_RX_RX_DEBUG_DL_LB_LOOP               ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_DEBUG_DL_LB_LOOP_POS)) /**< RX_DEBUG_DL_LB_LOOP Mask */
#define MXC_V_DBB_RX_RX_DEBUG_DL_LB_LOOP_LOOPBACK      ((uint32_t)0x1UL) /**< RX_DEBUG_DL_LB_LOOP_LOOPBACK Value */
#define MXC_S_DBB_RX_RX_DEBUG_DL_LB_LOOP_LOOPBACK      (MXC_V_DBB_RX_RX_DEBUG_DL_LB_LOOP_LOOPBACK << MXC_F_DBB_RX_RX_DEBUG_DL_LB_LOOP_POS) /**< RX_DEBUG_DL_LB_LOOP_LOOPBACK Setting */
#define MXC_V_DBB_RX_RX_DEBUG_DL_LB_LOOP_NORMAL        ((uint32_t)0x0UL) /**< RX_DEBUG_DL_LB_LOOP_NORMAL Value */
#define MXC_S_DBB_RX_RX_DEBUG_DL_LB_LOOP_NORMAL        (MXC_V_DBB_RX_RX_DEBUG_DL_LB_LOOP_NORMAL << MXC_F_DBB_RX_RX_DEBUG_DL_LB_LOOP_POS) /**< RX_DEBUG_DL_LB_LOOP_NORMAL Setting */

/**@} end of group DBB_RX_RX_DEBUG_DL_LB_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_PHY_DBG_CFG DBB_RX_RX_PHY_DBG_CFG
 * @brief    RX debug config (cfg(0)=enable, cfg(1)=log to mem enable, cfg(4:2)=data source
 *           (0=IQ (after AGC), 1=IQ (after filter), 2=IQ (before AGC), 3=phase diff, 4=dbg
 *           counter))
 * @{
 */
#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_ENABLE_POS         0 /**< RX_PHY_DBG_CFG_ENABLE Position */
#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_ENABLE             ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_DBG_CFG_ENABLE_POS)) /**< RX_PHY_DBG_CFG_ENABLE Mask */

#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_LOG_POS            1 /**< RX_PHY_DBG_CFG_LOG Position */
#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_LOG                ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_PHY_DBG_CFG_LOG_POS)) /**< RX_PHY_DBG_CFG_LOG Mask */

#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS            2 /**< RX_PHY_DBG_CFG_SRC Position */
#define MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC                ((uint32_t)(0x7UL << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS)) /**< RX_PHY_DBG_CFG_SRC Mask */
#define MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_AGC   ((uint32_t)0x0UL) /**< RX_PHY_DBG_CFG_SRC_IQ_AFTER_AGC Value */
#define MXC_S_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_AGC   (MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_AGC << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS) /**< RX_PHY_DBG_CFG_SRC_IQ_AFTER_AGC Setting */
#define MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_FILTER ((uint32_t)0x1UL) /**< RX_PHY_DBG_CFG_SRC_IQ_AFTER_FILTER Value */
#define MXC_S_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_FILTER (MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_AFTER_FILTER << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS) /**< RX_PHY_DBG_CFG_SRC_IQ_AFTER_FILTER Setting */
#define MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_BEFORE_AGC  ((uint32_t)0x2UL) /**< RX_PHY_DBG_CFG_SRC_IQ_BEFORE_AGC Value */
#define MXC_S_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_BEFORE_AGC  (MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_IQ_BEFORE_AGC << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS) /**< RX_PHY_DBG_CFG_SRC_IQ_BEFORE_AGC Setting */
#define MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_PHASE          ((uint32_t)0x3UL) /**< RX_PHY_DBG_CFG_SRC_PHASE Value */
#define MXC_S_DBB_RX_RX_PHY_DBG_CFG_SRC_PHASE          (MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_PHASE << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS) /**< RX_PHY_DBG_CFG_SRC_PHASE Setting */
#define MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_DBG_COUNTER    ((uint32_t)0x4UL) /**< RX_PHY_DBG_CFG_SRC_DBG_COUNTER Value */
#define MXC_S_DBB_RX_RX_PHY_DBG_CFG_SRC_DBG_COUNTER    (MXC_V_DBB_RX_RX_PHY_DBG_CFG_SRC_DBG_COUNTER << MXC_F_DBB_RX_RX_PHY_DBG_CFG_SRC_POS) /**< RX_PHY_DBG_CFG_SRC_DBG_COUNTER Setting */

/**@} end of group DBB_RX_RX_PHY_DBG_CFG_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_CRC_MODE DBB_RX_RX_DL_CRC_MODE
 * @brief    crc_mode
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS            0 /**< RX_DL_CRC_MODE_PHR Position */
#define MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR                ((uint16_t)(0x3UL << MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS)) /**< RX_DL_CRC_MODE_PHR Mask */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_BYP            ((uint16_t)0x0UL) /**< RX_DL_CRC_MODE_PHR_BYP Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PHR_BYP            (MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_BYP << MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS) /**< RX_DL_CRC_MODE_PHR_BYP Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC4           ((uint16_t)0x1UL) /**< RX_DL_CRC_MODE_PHR_CRC4 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PHR_CRC4           (MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC4 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS) /**< RX_DL_CRC_MODE_PHR_CRC4 Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC16          ((uint16_t)0x2UL) /**< RX_DL_CRC_MODE_PHR_CRC16 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PHR_CRC16          (MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC16 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS) /**< RX_DL_CRC_MODE_PHR_CRC16 Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC24          ((uint16_t)0x3UL) /**< RX_DL_CRC_MODE_PHR_CRC24 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PHR_CRC24          (MXC_V_DBB_RX_RX_DL_CRC_MODE_PHR_CRC24 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PHR_POS) /**< RX_DL_CRC_MODE_PHR_CRC24 Setting */

