analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
#define MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS            2 /**< RX_DL_CRC_MODE_PLD Position */
#define MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD                ((uint16_t)(0x3UL << MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS)) /**< RX_DL_CRC_MODE_PLD Mask */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_BYP            ((uint16_t)0x0UL) /**< RX_DL_CRC_MODE_PLD_BYP Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PLD_BYP            (MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_BYP << MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS) /**< RX_DL_CRC_MODE_PLD_BYP Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC4           ((uint16_t)0x1UL) /**< RX_DL_CRC_MODE_PLD_CRC4 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PLD_CRC4           (MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC4 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS) /**< RX_DL_CRC_MODE_PLD_CRC4 Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC16          ((uint16_t)0x2UL) /**< RX_DL_CRC_MODE_PLD_CRC16 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PLD_CRC16          (MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC16 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS) /**< RX_DL_CRC_MODE_PLD_CRC16 Setting */
#define MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC24          ((uint16_t)0x3UL) /**< RX_DL_CRC_MODE_PLD_CRC24 Value */
#define MXC_S_DBB_RX_RX_DL_CRC_MODE_PLD_CRC24          (MXC_V_DBB_RX_RX_DL_CRC_MODE_PLD_CRC24 << MXC_F_DBB_RX_RX_DL_CRC_MODE_PLD_POS) /**< RX_DL_CRC_MODE_PLD_CRC24 Setting */

/**@} end of group DBB_RX_RX_DL_CRC_MODE_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_BCH DBB_RX_RX_DL_BCH
 * @brief    bch
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_BCH_PHR_ENABLE_POS          0 /**< RX_DL_BCH_PHR_ENABLE Position */
#define MXC_F_DBB_RX_RX_DL_BCH_PHR_ENABLE              ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_BCH_PHR_ENABLE_POS)) /**< RX_DL_BCH_PHR_ENABLE Mask */

#define MXC_F_DBB_RX_RX_DL_BCH_PLD_ENABLE_POS          1 /**< RX_DL_BCH_PLD_ENABLE Position */
#define MXC_F_DBB_RX_RX_DL_BCH_PLD_ENABLE              ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_BCH_PLD_ENABLE_POS)) /**< RX_DL_BCH_PLD_ENABLE Mask */

#define MXC_F_DBB_RX_RX_DL_BCH_BIT_ERR_NR_POS          2 /**< RX_DL_BCH_BIT_ERR_NR Position */
#define MXC_F_DBB_RX_RX_DL_BCH_BIT_ERR_NR              ((uint16_t)(0x7FUL << MXC_F_DBB_RX_RX_DL_BCH_BIT_ERR_NR_POS)) /**< RX_DL_BCH_BIT_ERR_NR Mask */

/**@} end of group DBB_RX_RX_DL_BCH_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_SPRD_SEQ_ERR_NR DBB_RX_RX_DL_SPRD_SEQ_ERR_NR
 * @brief    sprd
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_SPRD_SEQ_ERR_NR_SEQ_ERR_NR_POS 0 /**< RX_DL_SPRD_SEQ_ERR_NR_SEQ_ERR_NR Position */
#define MXC_F_DBB_RX_RX_DL_SPRD_SEQ_ERR_NR_SEQ_ERR_NR  ((uint16_t)(0xFFFUL << MXC_F_DBB_RX_RX_DL_SPRD_SEQ_ERR_NR_SEQ_ERR_NR_POS)) /**< RX_DL_SPRD_SEQ_ERR_NR_SEQ_ERR_NR Mask */

/**@} end of group DBB_RX_RX_DL_SPRD_SEQ_ERR_NR_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_BAN_SETTINGS DBB_RX_RX_DL_BAN_SETTINGS
 * @brief    ban_settings
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SCRMBL_SD_POS 0 /**< RX_DL_BAN_SETTINGS_PHR_SCRMBL_SD Position */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SCRMBL_SD  ((uint32_t)(0x1UL << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SCRMBL_SD_POS)) /**< RX_DL_BAN_SETTINGS_PHR_SCRMBL_SD Mask */

#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS 1 /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT Position */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT  ((uint32_t)(0x7UL << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS)) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT Mask */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 ((uint32_t)0x1UL) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_1 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 ((uint32_t)0x2UL) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_2 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 ((uint32_t)0x3UL) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_4 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 ((uint32_t)0x4UL) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_8 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 ((uint32_t)0x5UL) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PHR_SPRD_FACT_SPRD_FACT_16 Setting */

#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_MDR_LENGTH_POS 4 /**< RX_DL_BAN_SETTINGS_MDR_LENGTH Position */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_MDR_LENGTH     ((uint32_t)(0xFUL << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_MDR_LENGTH_POS)) /**< RX_DL_BAN_SETTINGS_MDR_LENGTH Mask */

#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS 8 /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD Position */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD   ((uint32_t)(0x7UL << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS)) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD Mask */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK ((uint32_t)0x0UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_OQPSK Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK ((uint32_t)0x1UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DBPSK Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK ((uint32_t)0x2UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_DQPSK Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK ((uint32_t)0x3UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_D8PSK Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK ((uint32_t)0x4UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GMSK Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK ((uint32_t)0x5UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_MOD_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_MOD_GFSK Setting */

