analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_rx_regs.h
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS 11 /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT Position */
#define MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT ((uint32_t)(0x7UL << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS)) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT Mask */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 ((uint32_t)0x1UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_1 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 ((uint32_t)0x2UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_2 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 ((uint32_t)0x3UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_4 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 ((uint32_t)0x4UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_8 Setting */
#define MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 ((uint32_t)0x5UL) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 Value */
#define MXC_S_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 (MXC_V_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 << MXC_F_DBB_RX_RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_POS) /**< RX_DL_BAN_SETTINGS_PROP_PLD_SPRD_FACT_SPRD_FACT_16 Setting */

/**@} end of group DBB_RX_RX_DL_BAN_SETTINGS_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_BTLE_SETTINGS_WHIT DBB_RX_RX_DL_BTLE_SETTINGS_WHIT
 * @brief    btle_settings_whit
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_CHAN_NR_POS 0 /**< RX_DL_BTLE_SETTINGS_WHIT_CHAN_NR Position */
#define MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_CHAN_NR  ((uint16_t)(0x3FUL << MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_CHAN_NR_POS)) /**< RX_DL_BTLE_SETTINGS_WHIT_CHAN_NR Mask */

#define MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_BYPASS_POS 6 /**< RX_DL_BTLE_SETTINGS_WHIT_BYPASS Position */
#define MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_BYPASS   ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_BYPASS_POS)) /**< RX_DL_BTLE_SETTINGS_WHIT_BYPASS Mask */

/**@} end of group DBB_RX_RX_DL_BTLE_SETTINGS_WHIT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_PHR_MODULATION DBB_RX_RX_DL_PHR_MODULATION
 * @brief    Header modulation: OQPSK=0,  1 = DBPSK 2 = DQPSK, 3 = D8PSK, 4 = GMSK, 5 = GFSK
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS      0 /**< RX_DL_PHR_MODULATION_MOD Position */
#define MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD          ((uint16_t)(0x7UL << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS)) /**< RX_DL_PHR_MODULATION_MOD Mask */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_OQPSK    ((uint16_t)0x0UL) /**< RX_DL_PHR_MODULATION_MOD_OQPSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_OQPSK    (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_OQPSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_OQPSK Setting */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_DBPSK    ((uint16_t)0x1UL) /**< RX_DL_PHR_MODULATION_MOD_DBPSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_DBPSK    (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_DBPSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_DBPSK Setting */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_DQPSK    ((uint16_t)0x2UL) /**< RX_DL_PHR_MODULATION_MOD_DQPSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_DQPSK    (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_DQPSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_DQPSK Setting */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_D8PSK    ((uint16_t)0x3UL) /**< RX_DL_PHR_MODULATION_MOD_D8PSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_D8PSK    (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_D8PSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_D8PSK Setting */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_GMSK     ((uint16_t)0x4UL) /**< RX_DL_PHR_MODULATION_MOD_GMSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_GMSK     (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_GMSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_GMSK Setting */
#define MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_GFSK     ((uint16_t)0x5UL) /**< RX_DL_PHR_MODULATION_MOD_GFSK Value */
#define MXC_S_DBB_RX_RX_DL_PHR_MODULATION_MOD_GFSK     (MXC_V_DBB_RX_RX_DL_PHR_MODULATION_MOD_GFSK << MXC_F_DBB_RX_RX_DL_PHR_MODULATION_MOD_POS) /**< RX_DL_PHR_MODULATION_MOD_GFSK Setting */

/**@} end of group DBB_RX_RX_DL_PHR_MODULATION_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_OUT_CRC_STAT DBB_RX_RX_DL_OUT_CRC_STAT
 * @brief    crc_stat
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PHR_NOK_POS    0 /**< RX_DL_OUT_CRC_STAT_PHR_NOK Position */
#define MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PHR_NOK        ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PHR_NOK_POS)) /**< RX_DL_OUT_CRC_STAT_PHR_NOK Mask */

#define MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PLD_NOK_POS    1 /**< RX_DL_OUT_CRC_STAT_PLD_NOK Position */
#define MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PLD_NOK        ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_OUT_CRC_STAT_PLD_NOK_POS)) /**< RX_DL_OUT_CRC_STAT_PLD_NOK Mask */

/**@} end of group DBB_RX_RX_DL_OUT_CRC_STAT_Register */

/**
 * @ingroup  dbb_rx_registers
 * @defgroup DBB_RX_RX_DL_OUT_CI DBB_RX_RX_DL_OUT_CI
 * @brief    When receiving a BTLE coded phy packet this field will indicate the value of the
 *           CI field (00 = S8 mode, 01=S2 mode, others resevered for future use)
 * @{
 */
#define MXC_F_DBB_RX_RX_DL_OUT_CI_CI_POS               0 /**< RX_DL_OUT_CI_CI Position */
#define MXC_F_DBB_RX_RX_DL_OUT_CI_CI                   ((uint16_t)(0x1UL << MXC_F_DBB_RX_RX_DL_OUT_CI_CI_POS)) /**< RX_DL_OUT_CI_CI Mask */
#define MXC_V_DBB_RX_RX_DL_OUT_CI_CI_S8                ((uint16_t)0x0UL) /**< RX_DL_OUT_CI_CI_S8 Value */
#define MXC_S_DBB_RX_RX_DL_OUT_CI_CI_S8                (MXC_V_DBB_RX_RX_DL_OUT_CI_CI_S8 << MXC_F_DBB_RX_RX_DL_OUT_CI_CI_POS) /**< RX_DL_OUT_CI_CI_S8 Setting */
#define MXC_V_DBB_RX_RX_DL_OUT_CI_CI_S2                ((uint16_t)0x1UL) /**< RX_DL_OUT_CI_CI_S2 Value */
#define MXC_S_DBB_RX_RX_DL_OUT_CI_CI_S2                (MXC_V_DBB_RX_RX_DL_OUT_CI_CI_S2 << MXC_F_DBB_RX_RX_DL_OUT_CI_CI_POS) /**< RX_DL_OUT_CI_CI_S2 Setting */

/**@} end of group DBB_RX_RX_DL_OUT_CI_Register */

#ifdef __cplusplus
}
#endif

#endif // MAX32665_INCLUDE_DBB_RX_REGS_H_
